# James Jones
## 12-5-2022

In [1]:
# Import Libraries
import pymysql
import os, json
import numpy as np
import pandas as pd
pymysql.install_as_MySQLdb()
from sqlalchemy.types import *
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

###  Load in DFs from part 2
- Our Stakeholder requested we process data from:
  - Title Basics
  - Title Ratings
  - TMDB Results

In [2]:
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,126,Drama

In [3]:
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
title_ratings

           tconst  averageRating  numVotes
0       tt0000001            5.7      1923
1       tt0000002            5.8       259
2       tt0000005            6.2      2549
3       tt0000006            5.1       175
4       tt0000007            5.4       798
...           ...            ...       ...
475954  tt9916204            8.2       250
475955  tt9916348            8.5        17
475956  tt9916362            6.4      4999
475957  tt9916428            3.8        14
475958  tt9916720            5.3       277

[475959 rows x 3 columns]

In [4]:
tmdb = pd.read_csv('Data/tmdb_results_no_cleaning.csv.gz')
tmdb

,index,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.104,2027.0,PG
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2502,1290,tt7797790,0.0,NaN,NaN,0.0,"[{'id': 27, 'name': 'Horror'}]",NaN,956219.0,en,...,0.0,72.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,NaN,Edmund Kemper Part 3: La mort sévit,0.0,0.000,0.0,NaN
2503,1291,tt8665056,0.0,NaN,NaN,0.0,"[{'id': 37, 'name': 'Western'}]",http://skeletoncreekproductions.com/p-movie-br...,885436.0,en,...,0.0,85.0,[],Released,Evil came to the Southwest until three blazing...,Guns Along The Bravo,0.0,0.000,0.0,NaN
2504,1292,tt8795764,0.0,NaN,NaN,0.0,"[{'id': 27, 'name': 'Horror'}]",https://www.utahwolf.com/films/coming-soon-new...,871624.0,en,...,0.0,57.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,New Breed,0.0,0.000,0.0,NR
2505,1293,tt9071078,0.0,NaN,NaN,0.0,"[{'id': 28, 'name': 'Action'}]",http://www.hkcinemagic.com/en/movie.asp?id=6627,201706.0,cn,...,0.0,90.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,NaN,Chinese Heroes,0.0,3.000,2.0,NaN
2506,1294,tt19637696,0.0,NaN,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,290640.0,en,...,0.0,22.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,The Tower of Babble,0.0,2.000,1.0,NaN

### Begin processing of Title Basics to only include:
- Movie ID (tconst)
- rimary Title
- Start Year
- Runtime (in Minutes)
- Genres

In [5]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,126,Drama

In [6]:
# Split off genres into 2 new tables
basics['split_genre'] = basics['genres'].str.split(',')
basics.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,split_genre
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,122,Drama,[Drama]

In [7]:
# Explode genres
genres_ex = basics.explode('split_genre')
genres_ex.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,runtimeMinutes,genres,split_genre
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,122,Drama,Drama

In [8]:
# Continue processing to separate genres and pair them with their corresponding tconst
split_genre = basics['genres'].str.split(',')
genre_unique = split_genre.explode().unique()
genre_unique

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'Horror', 'Sci-Fi',
       'Mystery', 'Musical', 'Action', 'Adventure', 'Crime', 'Thriller',
       'Music', 'Animation', 'Family', 'History', 'War', 'Biography',
       'Sport', 'Western', 'Adult', 'Short', 'Reality-TV', 'News',
       'Talk-Show', 'Game-Show'], dtype=object)

In [9]:
genre_unique = sorted(genres_ex['split_genre'].unique())
genre_unique

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [10]:
# Now copy our unique title genres and their paired tconst
title_genres = genres_ex[['tconst', 'split_genre']].copy()
title_genres.head()

      tconst split_genre
0  tt0035423      Comedy
0  tt0035423     Fantasy
0  tt0035423     Romance
1  tt0062336       Drama
2  tt0069049       Drama

### You can see that just like our basics DF above, we have 3 genres in a row with the same tcosnt
- This looks just like the 3 in a row (and the tcosnt matches) for Kate and Leopold. This shows that our split worked

In [11]:
# Assign unique genres to unique integers
genre_num = range(len(genre_unique))

# Create a map
genre_map = dict(zip(genre_unique, genre_num))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [12]:
# Add a new genre ID column
title_genres["genre_id"] = title_genres["split_genre"].map(genre_map)

In [13]:
# Drop split_genre column
title_genres = title_genres.drop(columns = 'split_genre')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [14]:
# Now, map our new table by creating genre IDs
genres = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [15]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

### We now have the 2 tables asked for in the LP:
- #### title_genres
  - tconst
  - genre_id
- #### genres
  - genre_id
  - genre_name

### Now, eliminate unnecessary columns according to our stakeholder's specifications

In [16]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75031 entries, 0 to 75030
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          75031 non-null  object
 1   titleType       75031 non-null  object
 2   primaryTitle    75031 non-null  object
 3   originalTitle   75031 non-null  object
 4   isAdult         75031 non-null  int64
 5   startYear       75031 non-null  float64
 6   runtimeMinutes  75031 non-null  int64
 7   genres          75031 non-null  object
 8   split_genre     75031 non-null  object
dtypes: float64(1), int64(2), object(6)
memory usage: 5.2+ MB

In [17]:
# NOTE: There are no null values to be dropped
basics = basics.drop(columns = ['originalTitle', 'isAdult',
                                'titleType', 'genres', 'split_genre'])
basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [18]:
# Change name to match LP
title_basics = basics.copy()

### We now have "title_basics", "genres", "title_genres", and "title_ratings"(already meets stakeholder's specifications
- We now need to clean up our TMBD data

In [19]:
tmdb.head()

,index,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.104,2027.0,PG

### "You only need to keep the imdb_id, revenue, budget, and certification columns"

In [20]:
tmdb_data = tmdb[['imdb_id', 'budget', 'revenue', 'certification']]
tmdb_data

         imdb_id      budget     revenue certification
0              0         NaN         NaN           NaN
1      tt0113026  10000000.0         0.0           NaN
2      tt0113092         0.0         0.0           NaN
3      tt0116391         0.0         0.0           NaN
4      tt0118694    150000.0  12854953.0            PG
...          ...         ...         ...           ...
2502   tt7797790         0.0         0.0           NaN
2503   tt8665056         0.0         0.0           NaN
2504   tt8795764         0.0         0.0            NR
2505   tt9071078         0.0         0.0           NaN
2506  tt19637696         0.0         0.0           NaN

[2507 rows x 4 columns]

### List of final tables
- tmdb_data
- title_basics
- genres
- title_genres
- title_ratings

In [21]:
# Save all of our new tables to csv files

tmdb_data.to_csv("Data/Tables/tmdb_data.csv.gz", compression = "gzip", index = False)
title_basics.to_csv("Data/Tables/title_basics.csv.gz", compression = "gzip", index = False)
genres.to_csv("Data/Tables/genres.csv.gz", compression = "gzip", index = False)
title_genres.to_csv("Data/Tables/title_genres.csv.gz", compression = "gzip", index = False)
title_ratings.to_csv("Data/Tables/title_ratings.csv.gz", compression = "gzip", index = False)

### Connect to MySQL

In [22]:
connection = "mysql+pymysql://root:JDJones91@localhost/movies"

In [23]:
engine = create_engine(connection)

In [24]:
# Create database with the 'if' statement
if database_exists(connection):
    print('DB Exists')
else:
    create_database(connection)
    print('DB created')

DB Exists

### Begin creating our primary keys for our tables/saving to SQL

In [25]:
# Start with title_basics
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

In [26]:
basics_df_schema = {'tconst': String(key_len + 1),
                    'primaryTitle': Text(title_len + 1),
                    'startYear': Float(),
                    'runtimeMinutes': Integer()}

In [27]:
title_basics.to_sql('title_basics', engine, dtype = basics_df_schema,
                    if_exists = 'replace', index = False)

75031

In [28]:
# Now title_ratings
key_len2 = title_ratings['tconst'].fillna('').map(len).max()

title_ratings_schema = {'tconst': String(key_len2 + 1),
                        'averageRating': Float(),
                        'numVotes': Integer()}

In [29]:
title_ratings.to_sql('title_ratings', engine, dtype = title_ratings_schema,
                     if_exists = 'replace', index = False)
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [30]:
# Create all other SQL tables
title_genres.to_sql('title_genres', engine, if_exists = 'replace')
genres.to_sql('genres', engine, if_exists = 'replace')
tmdb_data.to_sql("tmdb_data", engine, if_exists = "replace")

2507

### "After creating each table, show the first 5 rows of that table using a SQL query."

In [31]:
q = """SELECT *
FROM title_genres
LIMIT 5;"""
pd.read_sql(q, engine)

   index     tconst  genre_id
0      0  tt0035423         5
1      0  tt0035423         9
2      0  tt0035423        18
3      1  tt0062336         7
4      2  tt0069049         7

In [32]:
q = """SELECT *
FROM title_basics
LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [33]:
q = """SELECT *
FROM genres
LIMIT 5;"""
pd.read_sql(q, engine)

   index genre_name  genre_id
0      0     Action         0
1      1      Adult         1
2      2  Adventure         2
3      3  Animation         3
4      4  Biography         4

In [34]:
q = """SELECT *
FROM title_ratings
LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1923
1  tt0000002            5.8       259
2  tt0000005            6.2      2549
3  tt0000006            5.1       175
4  tt0000007            5.4       798

In [35]:
q = """SELECT *
FROM tmdb_data
LIMIT 5;"""
pd.read_sql(q, engine)

   index    imdb_id      budget     revenue certification
0      0          0         NaN         NaN          None
1      1  tt0113026  10000000.0         0.0          None
2      2  tt0113092         0.0         0.0          None
3      3  tt0116391         0.0         0.0          None
4      4  tt0118694    150000.0  12854953.0            PG

In [36]:
q = """SHOW TABLES"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

### 'movies.sql" uploaded to 'Data' folder